app/controllers/todo_controller.rb

  def index

    # @user = User.find
    @todos = Todo.all.order("created_at desc")
      @todo = Todo.new

    # @todos = Todo.all.order("created_at desc").limit(10).offset(@page * 10)
    # @todos = Todo.all.paginate :page => params[:page], :order => ("created_at desc")
    #@todos = Todo.paginate(:name).page params[:page]
    #Todo.paginate(page: params[:page], per_page: 10)
    @todos = @todos.paginate(:page => params[:page], :per_page => 10)
---
SELECT "todos".* FROM "todos" ORDER BY created_at desc
SELECT "todos".* FROM "todos" ORDER BY created_at desc LIMIT ? OFFSET ?  [["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "todos"

  def show
    @todo = Todo.find(params[:id])
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @todo = Todo.new(todoo_params)
    if @todo.save
---
INSERT INTO "todos" ("title", "completed_at", "note", "created_at", "updated_at", "priorty") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "first test"], ["completed_at", "2021-10-27 11:15:00"], ["note", ""], ["created_at", "2021-10-27 11:16:08.696718"], ["updated_at", "2021-10-27 11:16:08.696718"], ["priorty", 0]]

  def edit
    # debugger
    @todo = Todo.find(params[:id])
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update

    @todo = Todo.find(params[:id])
    if @todo.update(todoo_params)
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 37], ["LIMIT", 1]]
UPDATE "todos" SET "title" = ?, "note" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "1"], ["note", "1"], ["updated_at", "2021-10-27 06:16:59.886608"], ["id", 37]]

  def destroy
    @todo = Todo.find(params[:id])
    @todo.destroy
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 3]]